{
  "_name_or_path": "./model/medusa-1.0-zephyr-7b-beta",

  "architectures": [
    "MistralForCausalLM"
  ],
  "bos_token_id": 1,
  "eos_token_id": 2,
  "hidden_act": "silu",
  "hidden_size": 4096,
  "initializer_range": 0.02,
  "intermediate_size": 14336,
  "max_position_embeddings": 32768,

  "model_type": "mistral",
  "num_attention_heads": 32,
  "num_hidden_layers": 32,
  "num_key_value_heads": 8,
  "pad_token_id": 2,
  "rms_norm_eps": 1e-05,
  "rope_theta": 10000.0,
  "sliding_window": 4096,
  "tie_word_embeddings": false,
  "transformers_version": "4.34.0",
  "use_cache": true,
  "vocab_size": 32000,

  "do_sample":true,
  "max_steps":512,
  "temperature": 0.7,
  "posterior_threshold": 0.09,
  "posterior_alpha":0.3,
  "top_p":0.8,
  "sampling": "typical",
  "fast":true,


  "medusa_num_heads": 5,
  "medusa_num_layers": 1,
  "base_model_name_or_path": "./model/medusa-1.0-zephyr-7b-beta",

  "init_method":"tcp://192.168.123.96:23000",
  "distributed_backend":"gloo",
  "stage_num_hidden_layers_list":[  8,8,8,8],
  "device":"cuda",
  "torch_dtype": "bfloat16",
  "num_sub_sequences":5,
  "sub_sequence_length":128,
  "max_kv_cache_length": 2048
}
